{
    "format": "layers-model",
    "generatedBy": "keras v2.12.0",
    "convertedBy": "TensorFlow.js Converter v4.10.0",
    "modelTopology": {
        "keras_version": "2.12.0",
        "backend": "tensorflow",
        "model_config": {
            "class_name": "Model",
            "config": {
                "name": "decoder",
                "trainable": true,
                "layers": [
                    {
                        "class_name": "InputLayer",
                        "config": {
                            "batch_input_shape": [
                                null,
                                2
                            ],
                            "dtype": "float32",
                            "sparse": false,
                            "ragged": false,
                            "name": "input_2"
                        },
                        "name": "input_2",
                        "inbound_nodes": []
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "dense_2",
                            "trainable": true,
                            "dtype": "float32",
                            "units": 6272,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "dense_2",
                        "inbound_nodes": [
                            [
                                [
                                    "input_2",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Reshape",
                        "config": {
                            "name": "reshape",
                            "trainable": true,
                            "dtype": "float32",
                            "target_shape": [
                                7,
                                7,
                                128
                            ]
                        },
                        "name": "reshape",
                        "inbound_nodes": [
                            [
                                [
                                    "dense_2",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "conv2d_5",
                            "trainable": true,
                            "dtype": "float32",
                            "filters": 128,
                            "kernel_size": [
                                3,
                                3
                            ],
                            "strides": [
                                1,
                                1
                            ],
                            "padding": "same",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "conv2d_5",
                        "inbound_nodes": [
                            [
                                [
                                    "reshape",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "BatchNormalization",
                        "config": {
                            "name": "batch_normalization_6",
                            "trainable": true,
                            "dtype": "float32",
                            "axis": [
                                3
                            ],
                            "momentum": 0.99,
                            "epsilon": 0.001,
                            "center": true,
                            "scale": true,
                            "beta_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "gamma_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "moving_mean_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "moving_variance_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "beta_regularizer": null,
                            "gamma_regularizer": null,
                            "beta_constraint": null,
                            "gamma_constraint": null
                        },
                        "name": "batch_normalization_6",
                        "inbound_nodes": [
                            [
                                [
                                    "conv2d_5",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "UpSampling2D",
                        "config": {
                            "name": "up_sampling2d",
                            "trainable": true,
                            "dtype": "float32",
                            "size": [
                                2,
                                2
                            ],
                            "data_format": "channels_last",
                            "interpolation": "nearest"
                        },
                        "name": "up_sampling2d",
                        "inbound_nodes": [
                            [
                                [
                                    "batch_normalization_6",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "conv2d_6",
                            "trainable": true,
                            "dtype": "float32",
                            "filters": 64,
                            "kernel_size": [
                                3,
                                3
                            ],
                            "strides": [
                                1,
                                1
                            ],
                            "padding": "same",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "conv2d_6",
                        "inbound_nodes": [
                            [
                                [
                                    "up_sampling2d",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "BatchNormalization",
                        "config": {
                            "name": "batch_normalization_7",
                            "trainable": true,
                            "dtype": "float32",
                            "axis": [
                                3
                            ],
                            "momentum": 0.99,
                            "epsilon": 0.001,
                            "center": true,
                            "scale": true,
                            "beta_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "gamma_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "moving_mean_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "moving_variance_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "beta_regularizer": null,
                            "gamma_regularizer": null,
                            "beta_constraint": null,
                            "gamma_constraint": null
                        },
                        "name": "batch_normalization_7",
                        "inbound_nodes": [
                            [
                                [
                                    "conv2d_6",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "conv2d_7",
                            "trainable": true,
                            "dtype": "float32",
                            "filters": 64,
                            "kernel_size": [
                                3,
                                3
                            ],
                            "strides": [
                                1,
                                1
                            ],
                            "padding": "same",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "conv2d_7",
                        "inbound_nodes": [
                            [
                                [
                                    "batch_normalization_7",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "BatchNormalization",
                        "config": {
                            "name": "batch_normalization_8",
                            "trainable": true,
                            "dtype": "float32",
                            "axis": [
                                3
                            ],
                            "momentum": 0.99,
                            "epsilon": 0.001,
                            "center": true,
                            "scale": true,
                            "beta_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "gamma_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "moving_mean_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "moving_variance_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "beta_regularizer": null,
                            "gamma_regularizer": null,
                            "beta_constraint": null,
                            "gamma_constraint": null
                        },
                        "name": "batch_normalization_8",
                        "inbound_nodes": [
                            [
                                [
                                    "conv2d_7",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "UpSampling2D",
                        "config": {
                            "name": "up_sampling2d_1",
                            "trainable": true,
                            "dtype": "float32",
                            "size": [
                                2,
                                2
                            ],
                            "data_format": "channels_last",
                            "interpolation": "nearest"
                        },
                        "name": "up_sampling2d_1",
                        "inbound_nodes": [
                            [
                                [
                                    "batch_normalization_8",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "conv2d_8",
                            "trainable": true,
                            "dtype": "float32",
                            "filters": 32,
                            "kernel_size": [
                                3,
                                3
                            ],
                            "strides": [
                                1,
                                1
                            ],
                            "padding": "same",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "conv2d_8",
                        "inbound_nodes": [
                            [
                                [
                                    "up_sampling2d_1",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "BatchNormalization",
                        "config": {
                            "name": "batch_normalization_9",
                            "trainable": true,
                            "dtype": "float32",
                            "axis": [
                                3
                            ],
                            "momentum": 0.99,
                            "epsilon": 0.001,
                            "center": true,
                            "scale": true,
                            "beta_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "gamma_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "moving_mean_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "moving_variance_initializer": {
                                "class_name": "Ones",
                                "config": {}
                            },
                            "beta_regularizer": null,
                            "gamma_regularizer": null,
                            "beta_constraint": null,
                            "gamma_constraint": null
                        },
                        "name": "batch_normalization_9",
                        "inbound_nodes": [
                            [
                                [
                                    "conv2d_8",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "conv2d_9",
                            "trainable": true,
                            "dtype": "float32",
                            "filters": 1,
                            "kernel_size": [
                                3,
                                3
                            ],
                            "strides": [
                                1,
                                1
                            ],
                            "padding": "same",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "sigmoid",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "conv2d_9",
                        "inbound_nodes": [
                            [
                                [
                                    "batch_normalization_9",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    }
                ],
                "input_layers": [
                    [
                        "input_2",
                        0,
                        0
                    ]
                ],
                "output_layers": [
                    [
                        "conv2d_9",
                        0,
                        0
                    ]
                ]
            }
        }
    },
    "weightsManifest": [
        {
            "paths": [
                "group1-shard1of1.bin"
            ],
            "weights": [
                {
                    "name": "batch_normalization_6/gamma",
                    "shape": [
                        128
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_6/beta",
                    "shape": [
                        128
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_6/moving_mean",
                    "shape": [
                        128
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_6/moving_variance",
                    "shape": [
                        128
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_7/gamma",
                    "shape": [
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_7/beta",
                    "shape": [
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_7/moving_mean",
                    "shape": [
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_7/moving_variance",
                    "shape": [
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_8/gamma",
                    "shape": [
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_8/beta",
                    "shape": [
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_8/moving_mean",
                    "shape": [
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_8/moving_variance",
                    "shape": [
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_9/gamma",
                    "shape": [
                        32
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_9/beta",
                    "shape": [
                        32
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_9/moving_mean",
                    "shape": [
                        32
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "batch_normalization_9/moving_variance",
                    "shape": [
                        32
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv2d_5/kernel",
                    "shape": [
                        3,
                        3,
                        128,
                        128
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv2d_5/bias",
                    "shape": [
                        128
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv2d_6/kernel",
                    "shape": [
                        3,
                        3,
                        128,
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv2d_6/bias",
                    "shape": [
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv2d_7/kernel",
                    "shape": [
                        3,
                        3,
                        64,
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv2d_7/bias",
                    "shape": [
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv2d_8/kernel",
                    "shape": [
                        3,
                        3,
                        64,
                        32
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv2d_8/bias",
                    "shape": [
                        32
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv2d_9/kernel",
                    "shape": [
                        3,
                        3,
                        32,
                        1
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv2d_9/bias",
                    "shape": [
                        1
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_2/kernel",
                    "shape": [
                        2,
                        6272
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense_2/bias",
                    "shape": [
                        6272
                    ],
                    "dtype": "float32"
                }
            ]
        }
    ]
}